InformationRegisters/ДанныеПоискаФизическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ДанныеПоискаФизическихЛиц</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>АдресаЭлектроннойПочты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Телефоны</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛичныеДанныеКандидатов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ФизическиеЛицаКандидатов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ФизическиеЛицаКандидатов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЛичныеДанныеКандидата</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛичныеДанныеКандидатов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/ЛичныеДанныеКандидатов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ЛичныеДанныеКандидатов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ФИО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инициалы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УточнениеНаименования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеСлужебное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>120</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пол</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПолФизическогоЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоРождения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>240</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеВБраке</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СостояниеВБраке</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Гражданство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фотография</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛичныеДанныеКандидатовПрисоединенныеФайлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыДоступаКандидатов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗнаниеЯзыков</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Язык</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЯзыкиНародовМира</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтепеньЗнанияЯзыкаКандидата</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтепениЗнанияЯзыкаКандидата</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Образование</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидОбразования</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыОбразованияФизическихЛиц</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УчебноеЗаведение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УчебныеЗаведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Факультет</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Специальность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторСпециальностейПоОбразованию</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГодОкончания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Курсы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НаименованиеКурса</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УчебноеЗаведение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УчебныеЗаведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГодОкончания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДополнительнаяИнформация</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УченыеСтепени</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УченаяСтепень</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УченыеСтепени</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПрисужденияУченойСтепени</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОпытРаботы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Компания</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обязанности</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СфераДеятельностиКомпании</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ПодборПерсоналаФормы/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Дополняет колонки истории взаимоотношений.
// 
// Параметры:
//  Таблица - ТаблицаЗначений
Процедура ДополнитьКолонкиИсторииВзаимоотношений(Таблица) Экспорт
	Таблица.Колонки.Добавить("Кандидат", Новый ОписаниеТипов("СправочникСсылка.Кандидаты"));
	Таблица.Колонки.Добавить("ЛичныеДанныеКандидата", Новый ОписаниеТипов("СправочникСсылка.ЛичныеДанныеКандидатов"));
КонецПроцедуры

// Формирует запрос для поиска похожих физических лиц.
// 
// Параметры:
//  Запрос - Запрос
//  ПараметрыПоиска - см. СотрудникиКлиентСервер.ПараметрыПоискаПохожих
Процедура СформироватьЗапросПоискаПохожихФизическихЛиц(Запрос, ПараметрыПоиска) Экспорт
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ФизическиеЛица.Ссылка КАК Ссылка,
		|	ФизическиеЛица.Наименование КАК Наименование,
		|	ФизическиеЛица.УточнениеНаименования КАК УточнениеНаименования,
		|	1 КАК Приоритет
		|ИЗ
		|	Справочник.ФизическиеЛица КАК ФизическиеЛица
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПоискаФизическихЛиц КАК ДанныеПоискаФизическихЛиц
		|		ПО (ДанныеПоискаФизическихЛиц.ФизическоеЛицо = ФизическиеЛица.Ссылка)
		|ГДЕ
		|	&НомерТелефона
		|	И ФизическиеЛица.Ссылка <> &ФизическоеЛицо
		|	И НЕ ФизическиеЛица.ПометкаУдаления
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ФизическиеЛица.Ссылка,
		|	ФизическиеЛица.Наименование,
		|	ФизическиеЛица.УточнениеНаименования,
		|	2
		|ИЗ
		|	Справочник.ФизическиеЛица КАК ФизическиеЛица
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПоискаФизическихЛиц КАК ДанныеПоискаФизическихЛиц
		|		ПО (ДанныеПоискаФизическихЛиц.ФизическоеЛицо = ФизическиеЛица.Ссылка)
		|ГДЕ
		|	&АдресЭП
		|	И ФизическиеЛица.Ссылка <> &ФизическоеЛицо
		|	И НЕ ФизическиеЛица.ПометкаУдаления
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ФизическиеЛица.Ссылка,
		|	ФизическиеЛица.Наименование,
		|	ФизическиеЛица.УточнениеНаименования,
		|	3
		|ИЗ
		|	Справочник.ФизическиеЛица КАК ФизическиеЛица
		|ГДЕ
		|	ФизическиеЛица.Ссылка <> &ФизическоеЛицо
		|	И НЕ ФизическиеЛица.ПометкаУдаления
		|	И &ФИО";
		
	Если ЗначениеЗаполнено(ПараметрыПоиска.Телефон) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&НомерТелефона",
			"ДанныеПоискаФизическихЛиц.Телефоны ПОДОБНО &НомерТелефона");
		Запрос.УстановитьПараметр("НомерТелефона",
			"%" + ПоискФизическихЛиц.ТелефонВФорматеПоиска(ПараметрыПоиска.Телефон) + "%");
	Иначе
		Запрос.УстановитьПараметр("НомерТелефона", Ложь);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПараметрыПоиска.Email) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&АдресЭП",
			"ДанныеПоискаФизическихЛиц.АдресаЭлектроннойПочты ПОДОБНО &АдресЭП");
		Запрос.УстановитьПараметр("АдресЭП", "%" + ПараметрыПоиска.Email + "%");
	Иначе
		Запрос.УстановитьПараметр("АдресЭП", Ложь);
	КонецЕсли;
	
КонецПроцедуры

// Добавляет и заполняет колонку "СовпадающиеДанные" в таблице похожих кандидатов.
// 
// Параметры:
//  ТаблицаПохожих - ТаблицаЗначений -:
//   * Ссылка - СправочникСсылка.ФизическиеЛица -
//   * Наименование - Строка -
//   * Приоритет - Число -
//  ТаблицаДанных - ТаблицаЗначений
//  ИмяКолонкиПохожих - Строка
//  ИмяКолонкиДанных - Строка
Процедура ДобавитьЗаполнитьКолонкуСовпадающиеДанные(ТаблицаПохожих, ТаблицаДанных, ИмяКолонкиПохожих,
	ИмяКолонкиДанных) Экспорт

	Если ТаблицаДанных.Колонки.Найти("СовпадающиеДанные") = Неопределено Тогда
		ТаблицаДанных.Колонки.Добавить("СовпадающиеДанные", Новый ОписаниеТипов("Строка"));
	КонецЕсли;
	
	Для Каждого ТекущаяСтрока Из ТаблицаДанных Цикл
		
		НайденныеСтроки = ТаблицаПохожих.НайтиСтроки(Новый Структура(ИмяКолонкиПохожих, ТекущаяСтрока[ИмяКолонкиДанных]));
		ОбщегоНазначенияКлиентСервер.Проверить(НайденныеСтроки.Количество() > 0,
			СтрШаблон(НСтр("ru = 'Не найдены данные %1 в таблице похожих'"), ТекущаяСтрока[ИмяКолонкиДанных]),
			"ПодборПерсоналаФормы.ДобавитьЗаполнитьКолонкуСовпадающиеДанные");
		
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			ТекущаяСтрока.СовпадающиеДанные = ТекущаяСтрока.СовпадающиеДанные
				+ СовпадающиеДанныеПоПриоритету()[НайденнаяСтрока.Приоритет] + ",";
		КонецЦикла;
		
		Если Не ПустаяСтрока(ТекущаяСтрока.СовпадающиеДанные) Тогда
			СтроковыеФункцииКлиентСервер.УдалитьПоследнийСимволВСтроке(ТекущаяСтрока.СовпадающиеДанные);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Добавляет в ДополнительныеСвойства объекта физического лица связанные данные.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//  ФизическоеЛицоОбъект - СправочникОбъект.ФизическиеЛица
Процедура ЗаполнитьСвязанныеДанныеФизическогоЛица(Форма, ФизическоеЛицоОбъект) Экспорт
	
	Если Не ЗначениеЗаполнено(Форма.ЛичныеДанныеКандидатаСсылка) Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеФизическогоЛица = КадровыйУчет.НовыеДанныеФизическогоЛица();
	
	ДополнительныеПараметры = Новый Структура;
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "АдресФотографии") Тогда
		ДополнительныеПараметры.Вставить("АдресФотографии", Форма.АдресФотографии);
	КонецЕсли;
	Справочники.ЛичныеДанныеКандидатов.ЗаполнитьДанныеФизическогоЛица(ДанныеФизическогоЛица,
		Форма.ЛичныеДанныеКандидатаСсылка, ДополнительныеПараметры);
	СвязанныеОбъекты = КадровыйУчет.СвязанныеОбъектыДанныхФизическогоЛица(ДанныеФизическогоЛица);
	СвязанныеОбъекты.Вставить("ЛичныеДанныеКандидата", Форма.ЛичныеДанныеКандидатаСсылка);
	
	ФизическоеЛицоОбъект.ДополнительныеСвойства.Вставить("СвязанныеОбъекты", СвязанныеОбъекты);
	
КонецПроцедуры

// Устанавливает параметры открытия формы физические лица с похожими данными.
// 
// Параметры:
//  ПараметрыФормы - Структура
Процедура ФизическиеЛицаСПохожимиДаннымиПриСозданииНаСервере(ПараметрыФормы) Экспорт
	
	Если Не ПараметрыФормы.Свойство("ДанныеКандидатов") Тогда
		Возврат;
	КонецЕсли;
	
	КоличествоНайденных = ПараметрыФормы.ДанныеФизическихЛиц.Количество()
		+ ПараметрыФормы.ДанныеКандидатов.Количество();
	ПараметрыФормы.КлючНазначенияИспользования = ?(КоличествоНайденных < 2, "БезСписка", "СоСписком");
	
	ПараметрыФормы.ДанныеФизическихЛицДоступны = 
		(ПараметрыФормы.ДанныеФизическихЛиц.Количество() = 0
			Или ПараметрыФормы.ДанныеФизическихЛицДоступны)
		И (ПараметрыФормы.ДанныеКандидатов.Количество() = 0
			Или ПараметрыФормы.ДанныеКандидатовДоступны);
			
КонецПроцедуры

// Дополняет однофамильцев кандидатами.
// 
// Параметры:
//  Однофамильцы - ДанныеФормыКоллекция
//  ДанныеКандидатов - ТаблицаЗначений
Процедура ДополнитьОднофамильцев(Однофамильцы, ДанныеКандидатов) Экспорт

	Для Каждого СтрокаДанных Из ДанныеКандидатов Цикл
		НоваяСтрока = Однофамильцы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДанных);
		НоваяСтрока.ФИОПолные = СтрокаДанных.ФИО;
		Если ЗначениеЗаполнено(НоваяСтрока.ДатаРождения) Тогда
			НоваяСтрока.ВозрастПредставление = ФизическиеЛицаЗарплатаКадрыКлиентСервер.ПредставлениеВозраста(
				НоваяСтрока.ДатаРождения, ТекущаяДатаСеанса());
		КонецЕсли;
		НоваяСтрока.МобильныйТелефон = СтрокаДанных.Телефон;
		НоваяСтрока.АдресЭлектроннойПочты = СтрокаДанных.EMail;
		НоваяСтрока.ПолПредставление = ФизическиеЛицаЗарплатаКадрыКлиентСервер.ПредставлениеПола(СтрокаДанных.Пол);
		НоваяСтрока.АдресФотографии = ПодборПерсонала.АдресФотографииЛичныхДанныхКандидата(СтрокаДанных.ЛичныеДанныеКандидата);
	КонецЦикла;
	
КонецПроцедуры

// Добавляет реквизиты в форму поиска однофамильцев.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
Процедура ДобавитьРеквизитыФормыПоискаОднофамильцев(Форма) Экспорт
	
	ДобавляемыеРеквизиты = Новый Массив;
	ОписаниеТиповЛичныеДанныеКандидатов = Новый ОписаниеТипов("СправочникСсылка.ЛичныеДанныеКандидатов");
	
	РеквизитЛичныеДанныеКандидата = Новый РеквизитФормы("ЛичныеДанныеКандидата", ОписаниеТиповЛичныеДанныеКандидатов);
	ДобавляемыеРеквизиты.Добавить(РеквизитЛичныеДанныеКандидата);
	
	КолонкаОднофамильцыЛичныеДанныеКандидата = Новый РеквизитФормы("ЛичныеДанныеКандидата", 
		ОписаниеТиповЛичныеДанныеКандидатов, "Однофамильцы");
	ДобавляемыеРеквизиты.Добавить(КолонкаОднофамильцыЛичныеДанныеКандидата);
	
	КолонкаВсеОднофамильцыЛичныеДанныеКандидата = Новый РеквизитФормы("ЛичныеДанныеКандидата",
		ОписаниеТиповЛичныеДанныеКандидатов, "ВсеОднофамильцы");
	ДобавляемыеРеквизиты.Добавить(КолонкаВсеОднофамильцыЛичныеДанныеКандидата);
	
	КолонкаИсторияЛичныеДанныеКандидата = Новый РеквизитФормы("ЛичныеДанныеКандидата", 
		ОписаниеТиповЛичныеДанныеКандидатов, "История");
	ДобавляемыеРеквизиты.Добавить(КолонкаИсторияЛичныеДанныеКандидата);
	
	КолонкаОднофамильцыСовпавшиеДанные = Новый РеквизитФормы("СовпадающиеДанные", Новый ОписаниеТипов("Строка"),
		"Однофамильцы");
	ДобавляемыеРеквизиты.Добавить(КолонкаОднофамильцыСовпавшиеДанные);
	
	КолонкаВсеОднофамильцыСовпавшиеДанные = Новый РеквизитФормы("СовпадающиеДанные", Новый ОписаниеТипов("Строка"),
		"ВсеОднофамильцы");
	ДобавляемыеРеквизиты.Добавить(КолонкаВсеОднофамильцыСовпавшиеДанные);
	
	Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
КонецПроцедуры

// Заполняет данные физического лица по кандидату в форме физического лица.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения -
Процедура ЗаполнитьФизическоеЛицоПоКандидату(Форма) Экспорт
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИдентификаторФормы", Форма.УникальныйИдентификатор);
	
	УстановитьПривилегированныйРежим(Истина);
	ФизическоеЛицоОбъект = Справочники.ЛичныеДанныеКандидатов.ОбъектФизическоеЛицоПоДаннымКандидата(
		Форма.ЛичныеДанныеКандидатаСсылка, ДополнительныеПараметры);
	УстановитьПривилегированныйРежим(Ложь);
	
	Форма.ЗначениеВРеквизитФормы(ФизическоеЛицоОбъект, "ФизическоеЛицо");
	Форма.ФизическоеЛицоМестоРождения = ПерсонифицированныйУчетКлиентСервер.ПредставлениеМестаРождения(
		Форма.ФизическоеЛицо.МестоРождения);
	Форма.АдресФотографии = ФизическоеЛицоОбъект.ДополнительныеСвойства.СвязанныеОбъекты.АдресФотографии;
	
	Для Каждого ЭлементКонтактнойИнформации Из Форма.ФизическоеЛицо.КонтактнаяИнформация Цикл
		Для Каждого ОписаниеРеквизита Из Форма.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов Цикл
			Если ОписаниеРеквизита.Вид <> ЭлементКонтактнойИнформации.Вид Тогда
				Продолжить;
			КонецЕсли;
			ОписаниеРеквизита.Значение = ЭлементКонтактнойИнформации.Значение;
			ОписаниеРеквизита.Представление = ЭлементКонтактнойИнформации.Представление;
			Форма[ОписаниеРеквизита.ИмяРеквизита] = ЭлементКонтактнойИнформации.Представление;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ЗащитаПерсональныхДанных

// Вызывается при получении формой данных объекта. Дополняет состав элементов формы надписью о статусе согласия 
// на обработку персональных данных субъекта и декорацией отсутствия согласия. Формирует текст надписи.
//
// Параметры:
//	Форма				- ФормаКлиентскогоПриложения - форма, связанная с субъектом.
//	ТекущийОбъект		- СправочникОбъект - объект, который будет прочитан.
//	ИмяКлючевогоПоля	- Строка - "Ссылка" или заданное имя реквизита, содержащего ссылку на субъект.
//
Процедура ФормаСубъектаПриПолученииДанныхНаСервере(Форма, ТекущийОбъект, ИмяКлючевогоПоля = "Ссылка") Экспорт
	
	Элементы = Форма.Элементы;
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьСкрытиеПерсональныхДанныхСубъектов") Тогда
		Возврат;
	КонецЕсли;
	
	ГруппаСведения = Элементы.Найти("ГруппаСведенияОСогласииНаОбработкуПДн");
	Если ГруппаСведения = НеОпределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПравоДоступа("Изменение", Метаданные.Справочники.ЛичныеДанныеКандидатов) Тогда
		Возврат;
	КонецЕсли;
	
	Субъект = ТекущийОбъект[ИмяКлючевогоПоля];
	
	ФизическоеЛицо = ПодборПерсонала.ФизическоеЛицоЛичныхДанныхКандидата(Субъект);
	Если ЗначениеЗаполнено(ФизическоеЛицо) Тогда
		Возврат;
	КонецЕсли;
	
	Если Элементы.Найти("ДекорацияПредупреждениеОбОтсутствииСогласия") = НеОпределено Тогда
		
		Элемент = Элементы.Добавить("ДекорацияПредупреждениеОбОтсутствииСогласия", Тип("ДекорацияФормы"), ГруппаСведения);
		Элемент.Заголовок = НСтр("ru = 'Предупреждение об отсутствии согласия'");
		Элемент.Вид = ВидДекорацииФормы.Картинка;
		Элемент.Картинка = БиблиотекаКартинок.Предупреждение;
		Элемент.ЦветТекста = ЦветаСтиля.ПоясняющийТекст;
		
	КонецЕсли;
	
	Если Элементы.Найти("СообщениеОСогласииНаОбработкуПДн") = НеОпределено Тогда
		
		Элемент = Элементы.Вставить("СообщениеОСогласииНаОбработкуПДн", Тип("ДекорацияФормы"), ГруппаСведения);
		Элемент.Заголовок = Новый ФорматированнаяСтрока("");
		Элемент.Вид = ВидДекорацииФормы.Надпись;
		Элемент.ЦветТекста = ЦветаСтиля.ПоясняющийТекст;
		Элемент.АвтоМаксимальнаяШирина = Ложь;
		Элемент.УстановитьДействие("ОбработкаНавигационнойСсылки", "Подключаемый_СообщениеОСогласииОбработкаНавигационнойСсылки");
		
	КонецЕсли;
	
	ЭлементНадписи = Элементы.Найти("СообщениеОСогласииНаОбработкуПДн");
	ЭлементДекорации = Элементы.ДекорацияПредупреждениеОбОтсутствииСогласия;
	
	ГруппаСведения.Видимость = ОбщегоНазначения.СсылкаСуществует(Субъект);
	
	СтатусСогласия = СтатусСогласияНаОбработкуПДнСубъекта(Субъект);
	
	ЭлементДекорации.Видимость = СтатусСогласия.Требуется;
	ЭлементНадписи.Заголовок = СтатусСогласия.Описание;
	
КонецПроцедуры

// В форме списка заполняет колонку с картинкой, сигнализирующей об отсутствии требуемого согласия 
// на обработку персональных данных кандидата.
// Вызывается из события ПриПолученииДанныхНаСервере формы списка.
//
// Параметры:
//	Настройки			- НастройкиКомпоновкиДанных - содержит копию полных настроек динамического списка.
//	Строки				- СтрокиДинамическогоСписка - коллекция содержит данные и оформление всех строк,
//							получаемых в списке, кроме строк группировок.
//	ИмяКлючевогоПоля	- Строка - "Ссылка" или заданное имя колонки, содержащей ссылку на субъект.
//
Процедура СписокСубъектовПриПолученииДанныхНаСервере(Настройки, Строки, ИмяКлючевогоПоля = "Ссылка") Экспорт
	
	Перем ТекущаяДата;
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьСкрытиеПерсональныхДанныхКандидатов") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Настройки.ДополнительныеСвойства.Свойство("ТекущаяДата", ТекущаяДата) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Субъекты = Новый Массив;
	СубъектыПоКлючу = Новый Соответствие;
	СтрокиСубъектов = Новый Соответствие;
	
	СубъектыПоКлючу = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(Строки.ПолучитьКлючи(), ИмяКлючевогоПоля);
	
	Для Каждого Строка Из Строки Цикл
		
		Если ИмяКлючевогоПоля = "Ссылка" Тогда
			Субъект = Строка.Ключ;
		Иначе
			Субъект = СубъектыПоКлючу.Получить(Строка.Ключ);
		КонецЕсли;
		
		Субъекты.Добавить(Субъект);
		СтрокиСубъектов.Вставить(Субъект, Строка);
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаСубъектыДляСкрытияПерсональныхДанных(Истина) + "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Субъекты.Субъект КАК Субъект
	|ИЗ
	|	ВТСубъектыДляСкрытия КАК Субъекты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СубъектыДляСкрытияПерсональныхДанных КАК СубъектыДляСкрытияПДн
	|		ПО СубъектыДляСкрытияПДн.Субъект = Субъекты.Субъект
	|ГДЕ
	|	Субъекты.Субъект В(&Субъекты)
	|	И СубъектыДляСкрытияПДн.Субъект ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СубъектыДляСкрытияПДн.Субъект
	|ИЗ
	|	РегистрСведений.СубъектыДляСкрытияПерсональныхДанных КАК СубъектыДляСкрытияПДн
	|ГДЕ
	|	СубъектыДляСкрытияПДн.Субъект В(&Субъекты)
	|	И СубъектыДляСкрытияПДн.ДатаСкрытия > &ПустаяДата
	|	И СубъектыДляСкрытияПДн.ДатаСкрытия <= &РасчетнаяДата
	|	И СубъектыДляСкрытияПДн.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияСубъектовДляСкрытия.ГотовКСкрытию)";
	
	Запрос.УстановитьПараметр("Субъекты", Субъекты);
	Запрос.УстановитьПараметр("ПустаяДата", '00010101');
	Запрос.УстановитьПараметр("РасчетнаяДата", ТекущаяДата);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		СтрокаСписка = СтрокиСубъектов.Получить(Выборка.Субъект).Значение;
		СтрокаСписка.Данные["ОтсутствуетСогласие"] = 1;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

Процедура ФизическиеЛицаФормаЭлементаПриСозданииНаСервере(Форма, ГруппаКоманд) Экспорт

	Если Не ПодборПерсонала.ИспользоватьКандидатов() Тогда
		Возврат;
	КонецЕсли;
	
	СоздатьКомандуДобавленияНовогоКандидата(Форма, ГруппаКоманд);	
	
КонецПроцедуры

Процедура ПриНастройкеОтбораИсторииВзаимоотношенийФизическогоЛица(Форма, ПереключательОтбора) Экспорт 

	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьПодборПерсонала") Тогда
		Возврат;
	КонецЕсли;

	ПереключательОтбора.СписокВыбора.Добавить(3, НСтр("ru = 'Кандидаты'"));

КонецПроцедуры

// Добавляет команды в подменю "Оформить документ" для справочника "Сотрудники".
// См. СотрудникиФормыРасширенный.ОписаниеМенюВводаНаОсновании.
// 
// Параметры:
// 	ОписаниеМеню
//
Процедура ДобавитьПодменюПодбораПерсонала(ОписаниеМеню) Экспорт
	
	Если Не ПравоДоступа("Изменение", Метаданные.Справочники.Вакансии) Тогда
		Возврат;
	КонецЕсли;
	
	ПунктыМеню = Новый Массив;
	ПунктыМеню.Добавить("Справочники.Вакансии");

	Представления = Новый Соответствие;
	Представления.Вставить("Справочники.Вакансии", НСтр("ru = 'Открыть вакансию'"));

	РазделМеню = СотрудникиФормы.РазделМеню(НСтр("ru = 'Подбор персонала'"), ПунктыМеню, , Представления); 

	ОписаниеМеню.Пункты.Добавить(РазделМеню);
	
КонецПроцедуры

Процедура ДобавитьВМассивСоздаваемыеРеквизитыФормыСотрудника(МассивДобавляемыхРеквизитов, Отказ = Ложь) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ЛичныеДанныеКандидатаСсылкаРеквизитФормы = Новый РеквизитФормы("ЛичныеДанныеКандидатаСсылка",
		Новый ОписаниеТипов("СправочникСсылка.ЛичныеДанныеКандидатов"));
	МассивДобавляемыхРеквизитов.Добавить(ЛичныеДанныеКандидатаСсылкаРеквизитФормы);
	
	Если ПодборПерсонала.ИспользоватьКандидатов() Тогда
		КандидатРеквизитФормы = Новый РеквизитФормы("КандидатСсылка", Новый ОписаниеТипов("СправочникСсылка.Кандидаты"));
		МассивДобавляемыхРеквизитов.Добавить(КандидатРеквизитФормы);
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//  Форма - Форма
Процедура ПриСозданииНаСервереФормыСотрудника(Форма) Экспорт

	Если Не ПодборПерсонала.ИспользоватьКандидатов() Тогда
		Возврат;
	КонецЕсли;
	
	Кандидат = ПодборПерсонала.КандидатСотрудника(Форма.СотрудникСсылка);
	
	Если Кандидат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ГиперссылкаКандидата = Форма.Элементы.Добавить("Кнопка", Тип("КнопкаФормы"), Форма.Элементы.ГруппаПодборПерсонала);
	ГиперссылкаКандидата.Вид = ВидКнопкиФормы.Гиперссылка;
	
	Команда = Форма.Команды.Добавить("ОткрытьКандидатаСотрудника");
	Команда.Заголовок = НСтр("ru = 'Открыть кандидата сотрудника'");
	Команда.Подсказка = НСтр("ru = 'Перейти к кандидату'");
	Команда.Действие = "Подключаемый_ОткрытьКандидатаСотрудника";
	
	ГиперссылкаКандидата.ИмяКоманды = "ОткрытьКандидатаСотрудника";
	ГиперссылкаКандидата.Заголовок = НСтр("ru = 'О кандидате'");
	
	Форма.КандидатСсылка = Кандидат;
	
КонецПроцедуры

Процедура ЗаполнитьОжидаемыйДоходВВалютеПоУмолчанию(Настройки, Строки) Экспорт
	
	Кандидаты = Строки.ПолучитьКлючи();
	ДанныеКандидатов = Справочники.Кандидаты.ДанныеКандидатов(Кандидаты);
	
	Если ДанныеКандидатов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	КурсыВалют = Новый Соответствие;
	Если Настройки.ДополнительныеСвойства.Свойство("КурсыВалют") Тогда
		КурсыВалют = Настройки.ДополнительныеСвойства["КурсыВалют"];
	Иначе
		Настройки.ДополнительныеСвойства.Вставить("КурсыВалют", КурсыВалют);
	КонецЕсли;
	
	КолонкаОжидаемыйДоходВВалютеПоУмолчанию = Строки.Получить(Кандидаты[0]).Оформление.Получить("ОжидаемыйДоходВВалютеПоУмолчанию");
	КолонкаОжидаемыйДоход = Строки.Получить(Кандидаты[0]).Оформление.Получить("ОжидаемыйДоход");
	
	Для Каждого Кандидат Из ДанныеКандидатов Цикл
		СтрокаКандидат = Строки.Получить(Кандидат.Кандидат);
		Если СтрокаКандидат = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ОформлениеСтроки = СтрокаКандидат.Оформление;
		Если КолонкаОжидаемыйДоходВВалютеПоУмолчанию <> Неопределено Тогда
			ОжидаемыйДоходВВалютеПоУмолчанию = ПодборПерсоналаКлиентСервер.ОжидаемыйДоходВВалютеПоУмолчанию(
				Кандидат.ОжидаемыйДоход, Кандидат.ВалютаДохода, Кандидат.ПериодичностьДохода, КурсыВалют);
			ОформлениеСтроки["ОжидаемыйДоходВВалютеПоУмолчанию"].УстановитьЗначениеПараметра("Текст", ОжидаемыйДоходВВалютеПоУмолчанию);
		КонецЕсли;
		Если КолонкаОжидаемыйДоход <> Неопределено Тогда
			Если ЗначениеЗаполнено(Кандидат.ОжидаемыйДоход) Тогда
				ОжидаемыйДоход = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1 %2 %3'"),
					Кандидат.ОжидаемыйДоход, Кандидат.ВалютаДохода, Кандидат.ПериодичностьДохода);
			Иначе
				ОжидаемыйДоход = Формат(Кандидат.ОжидаемыйДоход, "ЧН=' '");
			КонецЕсли;
			ОформлениеСтроки["ОжидаемыйДоход"].УстановитьЗначениеПараметра("Текст", ОжидаемыйДоход);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#Область ПоискПохожихКандидатов

// Возвращает структуру параметров поиска похожих кандидатов.
// 
// Возвращаемое значение:
//  Структура:
//   * Ссылка - СправочникСсылка.ЛичныеДанныеКандидатов -
//   * Фамилия - Строка -
//   * Имя - Строка -
//   * Отчество - Строка -
//   * УточнениеНаименования - Строка -
//   * Телефон - Строка -
//   * Email - Строка -
Функция ПараметрыПоискаПохожихКандидатов() Экспорт
	
	ПараметрыПоиска = Новый Структура;
	ПараметрыПоиска.Вставить("Ссылка", Справочники.ЛичныеДанныеКандидатов.ПустаяСсылка());
	ПараметрыПоиска.Вставить("Фамилия", "");
	ПараметрыПоиска.Вставить("Имя", "");
	ПараметрыПоиска.Вставить("Отчество", "");
	ПараметрыПоиска.Вставить("УточнениеНаименования", "");
	ПараметрыПоиска.Вставить("Телефон", "");
	ПараметрыПоиска.Вставить("EMail", "");
	
	Возврат ПараметрыПоиска;
	
КонецФункции

// Подбирает похожих кандидатов.
// 
// Параметры:
//  ПараметрыПоиска - См. ПараметрыПоискаПохожихКандидатов
//  ИсключитьСвязанныхСФизЛицами - Булево
// 
// Возвращаемое значение:
//  Структура:
//   * Фамилия - Строка
//   * Имя - Строка
//   * Отчество - Строка
//   * Телефон - Строка
//   * EMail - Строка
//   * ДанныеКандидатовДоступны - Булево
//   * ДанныеКандидатов - Массив из Структура:
//      ** ЛичныеДанныеКандидата - СправочникСсылка.ЛичныеДанныеКандидатов 
//      ** Наименование - Строка 
//      ** УточнениеНаименования - Строка 
//      ** ФизическоеЛицо - СправочникСсылка.ФизическиеЛица 
//      ** НомерТелефона - Строка 
//      ** Email - Строка 
//      ** Приоритет - Число 
//   * КандидатУникален - Булево
Функция ПодобратьПохожихКандидатов(ПараметрыПоиска, ИсключитьСвязанныхСФизЛицами = Ложь) Экспорт
	
	СтруктураВозврат = Новый Структура;
	СтруктураВозврат.Вставить("Фамилия", ПараметрыПоиска.Фамилия);
	СтруктураВозврат.Вставить("Имя", ПараметрыПоиска.Имя);
	СтруктураВозврат.Вставить("Отчество", ПараметрыПоиска.Отчество);
	СтруктураВозврат.Вставить("Телефон", ПараметрыПоиска.Телефон);
	СтруктураВозврат.Вставить("EMail", ПараметрыПоиска.EMail);
	СтруктураВозврат.Вставить("ДанныеКандидатовДоступны", Истина);
	СтруктураВозврат.Вставить("ДанныеКандидатов", Новый Массив);
	СтруктураВозврат.Вставить("КандидатУникален", Истина);
	
	ПараметрыПоиска.Фамилия  = СОКРЛП(ПараметрыПоиска.Фамилия);
	ПараметрыПоиска.Имя = СОКРЛП(ПараметрыПоиска.Имя);
	ПараметрыПоиска.Отчество = СОКРЛП(ПараметрыПоиска.Отчество);
	
	УстановитьПривилегированныйРежим(Истина);
	ТаблицаПохожих = ПохожиеКандидаты(ПараметрыПоиска, ИсключитьСвязанныхСФизЛицами);
	МассивНайденных = ОбщегоНазначения.ВыгрузитьКолонку(ТаблицаПохожих, "ЛичныеДанныеКандидата", Истина);
	УстановитьПривилегированныйРежим(Ложь);
	
	Если МассивНайденных.Количество() = 0 Тогда
		Возврат СтруктураВозврат;
	КонецЕсли;
		
	СтруктураВозврат.КандидатУникален = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивЛичныхДанныхКандидатов", МассивНайденных);
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЛичныеДанныеКандидатов.Ссылка КАК ЛичныеДанныеКандидата
		|ИЗ
		|	Справочник.ЛичныеДанныеКандидатов КАК ЛичныеДанныеКандидатов
		|ГДЕ
		|	ЛичныеДанныеКандидатов.Ссылка В (&МассивЛичныхДанныхКандидатов)";
	МассивДоступных = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ЛичныеДанныеКандидата");
	
	СтруктураВозврат.ДанныеКандидатовДоступны = МассивДоступных.Количество() = МассивНайденных.Количество();
	ДанныеКандидатов = ПодборПерсонала.ОсновныеСведенияОЛичныхДанныхКандидатов(МассивДоступных);
	ДобавитьЗаполнитьКолонкуСовпадающиеДанные(ТаблицаПохожих, ДанныеКандидатов, "ЛичныеДанныеКандидата",
		"ЛичныеДанныеКандидата");
	
	СтруктураВозврат.ДанныеКандидатов = ОбщегоНазначения.ТаблицаЗначенийВМассив(ДанныеКандидатов);
	
	Возврат СтруктураВозврат;
	
КонецФункции

#КонецОбласти

Процедура ЗаполнитьИспытательныйСрок(Настройки, Строки) Экспорт
	
	ПрофилиДолжности = Строки.ПолучитьКлючи();
	ДанныеПрофилейДолжности = Справочники.ПрофилиДолжностей.ДанныеПрофилейДолжности(ПрофилиДолжности);
	
	Если ДанныеПрофилейДолжности.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ПрофильДолжности Из ДанныеПрофилейДолжности Цикл
		Если Не ЗначениеЗаполнено(ПрофильДолжности.ИспытательныйСрок) Тогда
			Продолжить;
		КонецЕсли;
		СтрокаПрофиль = Строки.Получить(ПрофильДолжности.Ссылка);
		Если СтрокаПрофиль = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ОформлениеСтроки = СтрокаПрофиль.Оформление;
		ОформлениеСтроки["ИспытательныйСрок"].УстановитьЗначениеПараметра("Текст", 
			СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(
			НСтр("ru = ';%1 месяц;;%1 месяца;%1 месяцев;'"), ПрофильДолжности.ИспытательныйСрок));
	КонецЦикла;
	
КонецПроцедуры

// Параметры:
//  Форма - ФормаКлиентскогоПриложения
Процедура НастройкиПользователейИПравПриСозданииНаСервере(Форма) Экспорт
	
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		
		Элементы = Форма.Элементы;
		
		НоваяГруппа = Элементы.Добавить("ДоступПоКандидатамГруппыДоступа", Тип("ГруппаФормы"),
			Элементы.ОграниченияПодробноФлаги);
		НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		НоваяГруппа.ОтображатьЗаголовок = Ложь;
		НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
		НоваяГруппа.Подсказка = НСтр("ru = 'Можно ограничивать доступ по группам кандидатов. 
			|Это потребует дополнительных ресурсов - применяйте только в случае необходимости.'");
		НоваяГруппа.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСнизу;
		
		ИмяРеквизита = "ОграничиватьДоступНаУровнеЗаписейЛичныеДанныеКандидатов";
		НовыйРеквизит = Новый РеквизитФормы(ИмяРеквизита, Новый ОписаниеТипов("Булево"), , , Ложь);
		ДобавляемыеРеквизиты = Новый Массив;
		ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
		Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
		Форма[ИмяРеквизита] = Константы.ОграничиватьДоступНаУровнеЗаписейЛичныеДанныеКандидатов.Получить();
		
		НовыйФлажок = Элементы.Добавить("ОграничиватьДоступНаУровнеЗаписейЛичныеДанныеКандидатов", Тип("ПолеФормы"),
			НоваяГруппа);
		НовыйФлажок.Вид = ВидПоляФормы.ПолеФлажка;
		НовыйФлажок.Заголовок = НСтр("ru = 'Доступ по группам кандидатов'");
		НовыйФлажок.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
		НовыйФлажок.ПутьКДанным = ИмяРеквизита;
		НовыйФлажок.УстановитьДействие("ПриИзменении",
			"Подключаемый_ОграничиватьДоступНаУровнеЗаписейЛичныеДанныеКандидатовПриИзменении");
	
		Если ОбщегоНазначения.ЭтоАвтономноеРабочееМесто() Тогда
			НовыйФлажок.Доступность = Ложь;
		КонецЕсли;
		
		ФорматированнаяСтрока = СтроковыеФункции.ФорматированнаяСтрока(
			НСтр("ru = '<a href=""%1"">Группы кандидатов</a>'"), "e1cib/list/Справочник.ГруппыДоступаКандидатов");
		Декорация = Элементы.Добавить("ГруппыДоступаКандидатовОткрытьСписок", Тип("ДекорацияФормы"), НоваяГруппа);
		Декорация.Вид = ВидДекорацииФормы.Надпись;
		Декорация.Заголовок = ФорматированнаяСтрока;
		Декорация.Видимость = ПолучитьФункциональнуюОпцию("ОграничиватьДоступНаУровнеЗаписейЛичныеДанныеКандидатов");
		
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//  Форма - ФормаКлиентскогоПриложения
Процедура ПрочитатьДанныеСвязанныеССотрудником(Форма) Экспорт
	
	Если Форма.СозданиеНового И Форма.ЛичныеДанныеКандидатаСсылка <> Неопределено
		И Не Форма.ЛичныеДанныеКандидатаСсылка.Пустая() Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		ФизическоеЛицоОбъект =
			Справочники.ЛичныеДанныеКандидатов.ОбъектФизическоеЛицоПоДаннымКандидата(Форма.ЛичныеДанныеКандидатаСсылка);
		Форма.ЗначениеВРеквизитФормы(ФизическоеЛицоОбъект, "ФизическоеЛицо");
		УстановитьПривилегированныйРежим(Ложь);
		
		СотрудникиФормыБазовый.ПрочитатьТекущиеДанныеСотрудника(Форма);
	Иначе
		СотрудникиФормыБазовый.ПрочитатьДанныеСвязанныеССотрудником(Форма);
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//  ФизическоеЛицоОбъект  - СправочникОбъект.ФизическиеЛица
//  СвязанныеОбъекты - Структура
Процедура ЗаписатьСвязанныеОбъектыФизическогоЛица(ФизическоеЛицоОбъект, СвязанныеОбъекты) Экспорт
	
	Если СвязанныеОбъекты.Свойство("ЛичныеДанныеКандидата") Тогда
		РегистрыСведений.ФизическиеЛицаКандидатов.УстановитьСвязьКандидатаСФизическимЛицом(
			СвязанныеОбъекты.ЛичныеДанныеКандидата, ФизическоеЛицоОбъект.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьЭтапыРаботыСКандидатамиПоУмолчанию(Форма, ЭтапыРаботыСКандидатами, ГруппаРезультатыПроверки) Экспорт
	
	Если ЭтапыРаботыСоответствуютУмолчанию(ЭтапыРаботыСКандидатами) Тогда
		ГруппаРезультатыПроверки.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	ГруппаРезультатыПроверки.Видимость = Истина;
	Если Форма.Элементы.Найти("ЭтапыПоУмолчаниюПредупреждение") = Неопределено Тогда
		Картинка = Форма.Элементы.Добавить("ЭтапыПоУмолчаниюПредупреждение", Тип("ДекорацияФормы"), ГруппаРезультатыПроверки);
		Картинка.Вид = ВидДекорацииФормы.Картинка;
		Картинка.Картинка = БиблиотекаКартинок.Предупреждение32;
		Картинка.РасширеннаяПодсказка.Заголовок = СтроковыеФункции.ФорматированнаяСтрока(
			НСтр("ru = 'Состав этапов работы отличается от предусмотренных программой по умолчанию.
				 |<a href = ""УстановитьЭтапыПоУмолчанию"">Нажмите здесь</a>, чтобы установить состав этапов по умолчанию.'"));
		Картинка.РасширеннаяПодсказка.АвтоМаксимальнаяШирина = Ложь;
		Картинка.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСправа;
	КонецЕсли;
	
КонецПроцедуры

Функция ЭтапыРаботыСоответствуютУмолчанию(ЭтапыРаботыСКандидатами)

	ЭтапыРаботы = ОбщегоНазначения.ВыгрузитьКолонку(ЭтапыРаботыСКандидатами, "ЭтапРаботы", Истина);

	// Есть все из действующих.
	Если РазностьМассивов(Перечисления.ЭтапыРаботыСКандидатами.Действующие(), ЭтапыРаботы).Количество() > 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// Нет ни одного из тех, которые есть во всех, но нет в действующих
	Недействующие = РазностьМассивов(Перечисления.ЭтапыРаботыСКандидатами.ВсеЭтапы(), 
		Перечисления.ЭтапыРаботыСКандидатами.Действующие());
	Если РазностьМассивов(Недействующие, ЭтапыРаботы).Количество() < Недействующие.Количество() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция РазностьМассивов(Массив, МассивВычитания)
	Возврат ОбщегоНазначенияКлиентСервер.РазностьМассивов(Массив, МассивВычитания);
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область НачальнаяНастройкаПрограммы

Процедура ЗначенияСохраняемыхРеквизитовФормыНачальнаяНастройкаПрограммы(Форма, СохраняемыеРеквизиты) Экспорт

	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьЗарплатаКадрыКорпоративнаяПодсистемы") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Форма.РаботаВКОРП Тогда
		Возврат;
	КонецЕсли;
	
	СохраняемыеРеквизиты.Вставить("ИспользоватьПодборПерсонала", Форма.ИспользоватьПодборПерсонала);
	
КонецПроцедуры

Процедура СохраненныеНастройкиВРеквизитыФормыНачальнаяНастройкаПрограммы(Форма, СохраненныеНастройки) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьЗарплатаКадрыКорпоративнаяПодсистемы") Тогда
		Возврат;
	КонецЕсли;
	
	Если СохраненныеНастройки.Свойство("ИспользоватьПодборПерсонала") Тогда
		Форма["ИспользоватьПодборПерсонала"] = СохраненныеНастройки["ИспользоватьПодборПерсонала"];
	КонецЕсли;
	
КонецПроцедуры

Процедура НастройкиПрограммыВРеквизитыФормы(Форма) Экспорт

	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьЗарплатаКадрыКорпоративнаяПодсистемы") Тогда
		Возврат;
	КонецЕсли;
	
	Форма.ИспользоватьПодборПерсонала = Константы.ИспользоватьПодборПерсонала.Получить();
	
КонецПроцедуры

#КонецОбласти

#Область ЗащитаПерсональныхДанных

Функция СтатусСогласияНаОбработкуПДнСубъекта(Субъект)
	
	СтатусСогласия = Новый Структура();
	СтатусСогласия.Вставить("Требуется", Ложь);
	СтатусСогласия.Вставить("Описание", ТекстСообщенияОтсутствующегоСогласия());
	
	Если ЗащитаПерсональныхДанных.ЭтоОбъектСУничтоженнымиПерсональнымиДанными(Субъект) Тогда
		СтатусСогласия.Описание = ТекстСообщенияСкрытогоСубъекта(
			ЗащитаПерсональныхДанных.ДатаУничтоженияДанныхСубъекта(Субъект));
		Возврат СтатусСогласия;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаСогласияНаОбработкуПерсональныхДанных();
	Запрос.УстановитьПараметр("Субъект", Субъект);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		Если ТипЗнч(ВыборкаДетальныеЗаписи.Регистратор) = Тип("ДокументСсылка.СогласиеНаОбработкуПерсональныхДанных") Тогда
			Если ВыборкаДетальныеЗаписи.СрокХранения = Дата(3999, 12, 31) Тогда
				СтатусСогласия.Описание = ТекстСообщенияБессрочногоСогласия(ВыборкаДетальныеЗаписи.Регистратор);
			Иначе
				СтатусСогласия.Описание = ТекстСообщенияДействующегоСогласия(ВыборкаДетальныеЗаписи.Регистратор);
			КонецЕсли;
		Иначе
			СтатусСогласия.Описание = ТекстСообщенияОтзываемогоСогласия(ВыборкаДетальныеЗаписи.Регистратор);
			СтатусСогласия.Требуется = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат СтатусСогласия;
	
КонецФункции

Функция ТекстЗапросаСогласияНаОбработкуПерсональныхДанных()
	
	ТекстЗапроса =
		"ВЫБРАТЬ
		|	СогласияНаОбработку.Субъект КАК Субъект,
		|	ВЫБОР
		|		КОГДА СогласияНаОбработку.Действует
		|			ТОГДА ВЫБОР
		|				КОГДА СогласияНаОбработку.СрокДействия = ДАТАВРЕМЯ(1, 1, 1)
		|					ТОГДА ДАТАВРЕМЯ(3999, 12, 31)
		|				ИНАЧЕ СогласияНаОбработку.СрокДействия
		|			КОНЕЦ
		|		ИНАЧЕ СогласияНаОбработку.Период
		|	КОНЕЦ КАК СрокХранения,
		|	СогласияНаОбработку.Действует КАК Действует,
		|	СогласияНаОбработку.Регистратор
		|ПОМЕСТИТЬ ВТСогласияНаОбработку
		|ИЗ
		|	РегистрСведений.СогласияНаОбработкуПерсональныхДанных.СрезПоследних(, Субъект = &Субъект) КАК СогласияНаОбработку
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТСогласияНаОбработку.Субъект КАК Субъект,
		|	МАКСИМУМ(ВТСогласияНаОбработку.СрокХранения) КАК СрокХранения
		|ПОМЕСТИТЬ ВТМаксимальныйСрокХранения
		|ИЗ
		|	ВТСогласияНаОбработку КАК ВТСогласияНаОбработку
		|СГРУППИРОВАТЬ ПО
		|	ВТСогласияНаОбработку.Субъект
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТСогласияНаОбработку.Субъект КАК Субъект,
		|	ВТСогласияНаОбработку.СрокХранения КАК СрокХранения,
		|	МАКСИМУМ(ВТСогласияНаОбработку.Действует) КАК Действует,
		|	МАКСИМУМ(ВТСогласияНаОбработку.Регистратор) КАК Регистратор
		|ИЗ
		|	ВТСогласияНаОбработку КАК ВТСогласияНаОбработку
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТМаксимальныйСрокХранения КАК ВТМаксимальныйСрокХранения
		|		ПО ВТСогласияНаОбработку.Субъект = ВТМаксимальныйСрокХранения.Субъект
		|		И ВТСогласияНаОбработку.СрокХранения = ВТМаксимальныйСрокХранения.СрокХранения
		|СГРУППИРОВАТЬ ПО
		|	ВТСогласияНаОбработку.Субъект,
		|	ВТСогласияНаОбработку.СрокХранения";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ГиперСсылкаСогласие(Согласие)
	
	Возврат Новый ФорматированнаяСтрока(НСтр("ru = 'согласие на обработку ПДн'"), , , , ПолучитьНавигационнуюСсылку(Согласие));
	
КонецФункции

Функция ГиперСсылкаОтзывСогласия(ОтзывСогласия)
	
	Возврат Новый ФорматированнаяСтрока(НСтр("ru = 'отзывается'"), , , , ПолучитьНавигационнуюСсылку(ОтзывСогласия));
	
КонецФункции

Функция ГиперСсылкаНовоеСогласие()
	
	Возврат Новый ФорматированнаяСтрока(НСтр("ru = 'ввести новое согласие'"), , , , "НовоеСогласие");
	
КонецФункции

Процедура ДобавитьЧастиВводаСогласия(ЧастиСообщения)
	
	ЧастиСообщения.Добавить(ГиперСсылкаНовоеСогласие());
	ЧастиСообщения.Добавить(НСтр("ru='.'"));
	
КонецПроцедуры

// Возвращаемое значение:
//  ФорматированнаяСтрока
Функция ТекстСообщенияДействующегоСогласия(Согласие)
	
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Согласие, "ДатаПолучения,СрокДействия");
	
	ДатаПолучения = ЗначенияРеквизитов.ДатаПолучения;
	СрокДействия = ЗначенияРеквизитов.СрокДействия;
	
	ЧастиСообщения = Новый Массив;
	ЧастиСообщения.Добавить(СтрШаблон(НСтр("ru='У субъекта %1 было получено'"), Формат(ДатаПолучения, "ДЛФ=D")) + " ");
	ЧастиСообщения.Добавить(ГиперСсылкаСогласие(Согласие));
	
	Если СрокДействия > ТекущаяДатаСеанса() Тогда
		ЧастиСообщения.Добавить(" " + СтрШаблон(НСтр("ru=', которое действует до %1.'"), Формат(СрокДействия, "ДЛФ=D")));
	Иначе
		
		ЧастиСообщения.Добавить(" " + СтрШаблон(НСтр("ru=', которое действовало до %1. Можно'") + " ", Формат(СрокДействия, "ДЛФ=D")));
		ДобавитьЧастиВводаСогласия(ЧастиСообщения);
		
	КонецЕсли;
	
	Возврат Новый ФорматированнаяСтрока(ЧастиСообщения);
	
КонецФункции

Функция ТекстСообщенияБессрочногоСогласия(Согласие)
	
	ДатаПолучения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Согласие, "ДатаПолучения");
	
	ЧастиСообщения = Новый Массив;
	ЧастиСообщения.Добавить(СтрШаблон(НСтр("ru='У субъекта %1 было получено'"), Формат(ДатаПолучения, "ДЛФ=D")) + " ");
	ЧастиСообщения.Добавить(ГиперСсылкаСогласие(Согласие));
	ЧастиСообщения.Добавить(" " + НСтр("ru=', которое действует бессрочно.'"));
	
	Возврат Новый ФорматированнаяСтрока(ЧастиСообщения);
	
КонецФункции

Функция ТекстСообщенияОтсутствующегоСогласия()
	
	ЧастиСообщения = Новый Массив;
	ЧастиСообщения.Добавить(НСтр("ru='У субъекта не было получено согласие на обработку ПДн. Можно'") + " ");
	
	ДобавитьЧастиВводаСогласия(ЧастиСообщения);
	
	Возврат Новый ФорматированнаяСтрока(ЧастиСообщения);
	
КонецФункции

Функция ТекстСообщенияОтзываемогоСогласия(ОтзывСогласия)
	
	ДатаОтзыва = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОтзывСогласия, "ДатаОтзыва");
	
	ЧастиСообщения = Новый Массив;
	ЧастиСообщения.Добавить(НСтр("ru='Согласие на обработку ПДн'") + " ");
	ЧастиСообщения.Добавить(ГиперСсылкаОтзывСогласия(ОтзывСогласия));
	ЧастиСообщения.Добавить(" " + СтрШаблон(НСтр("ru='%1. Можно'"), Формат(ДатаОтзыва, "ДЛФ=D")) + " ");
	
	ДобавитьЧастиВводаСогласия(ЧастиСообщения);
	
	Возврат Новый ФорматированнаяСтрока(ЧастиСообщения);
	
КонецФункции

Функция ТекстСообщенияСкрытогоСубъекта(ДатаСкрытия)
	
	ЧастиСообщения = Новый Массив;
	ЧастиСообщения.Добавить(СтрШаблон(НСтр("ru='Персональные данные субъекта уничтожены %1.'"), Формат(ДатаСкрытия, "ДЛФ=D")) + " ");
	ЧастиСообщения.Добавить(СтрШаблон(НСтр("ru='Истек срок согласия на обработку ПДн или согласие не было получено.'")));
	
	Возврат Новый ФорматированнаяСтрока(ЧастиСообщения);
	
КонецФункции

Функция ТекстЗапросаСубъектыДляСкрытияПерсональныхДанных(ВоВременнуюТаблицу = Ложь)
	
	ТекстЗапроса = "";
	ОсновнаяТаблица = Истина;
	МетаданныеПоТипамСубъекта = ЗащитаПерсональныхДанныхПовтИсп.МетаданныеПоТипамСубъекта();
	
	Для Каждого ТипСубъектаИМетаданные Из МетаданныеПоТипамСубъекта Цикл
		
		МетаданныеСубъекта = ТипСубъектаИМетаданные.Значение;
		
		ТекстЗапроса = ТекстЗапроса + ?(ПустаяСтрока(ТекстЗапроса),"", " ОБЪЕДИНИТЬ ВСЕ") + "
		|
		|ВЫБРАТЬ
		|	СправочникСубъекта.Ссылка КАК Субъект
		|[ПомещениеВоВременнуюТаблицу]
		|ИЗ
		|	Справочник." + МетаданныеСубъекта.Имя + " КАК СправочникСубъекта
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СубъектыДляСкрытияПерсональныхДанных КАК СубъектыДляСкрытияПерсональныхДанных 
		|		ПО СправочникСубъекта.Ссылка = СубъектыДляСкрытияПерсональныхДанных.Субъект
		|ГДЕ
		|	СубъектыДляСкрытияПерсональныхДанных.Субъект ЕСТЬ NULL";
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "[ПомещениеВоВременнуюТаблицу]",
			?(ВоВременнуюТаблицу И ОсновнаяТаблица, "ПОМЕСТИТЬ ВТСубъектыДляСкрытия", ""));
		
		ОсновнаяТаблица = Ложь;
		
	КонецЦикла;
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

Процедура УстановитьВидимостьЭлементаФормы(Элемент) Экспорт
	
	РекрутинговыеСайтыФормы.УстановитьВидимостьЭлементаФормы(Элемент);
	
КонецПроцедуры

Функция НавигациннаяСсылкаЭтапаКандидата(ЭтапРаботы) Экспорт
	
	ОбщегоНазначенияКлиентСервер.ПроверитьПараметр("СтрокаНавигационнойСсылкиЭтапаКандидатов", 
		"ЭтапРаботы", ЭтапРаботы, Метаданные.ОпределяемыеТипы.ЭтапРаботыСКандидатами.Тип);
	
	Строка = "ЭтапКандидата";
	Если ТипЗнч(ЭтапРаботы) = Тип("СправочникСсылка.ЭтапыРаботыСКандидатами") Тогда
		Строка = Строка + "_" + Метаданные.Справочники.ЭтапыРаботыСКандидатами.ПолноеИмя();
		Строка = Строка + "_" + ?(ЭтапРаботы.Пустая(), ИдентификаторПустогоЭтапа(), 
			ЭтапРаботы.УникальныйИдентификатор());
	ИначеЕсли ТипЗнч(ЭтапРаботы) = Тип("ПеречислениеСсылка.ЭтапыРаботыСКандидатами") Тогда
		Строка = Строка + "_" + Метаданные.Перечисления.ЭтапыРаботыСКандидатами.ПолноеИмя();
		Строка = Строка + "_" + ?(ЭтапРаботы.Пустая(), ИдентификаторПустогоЭтапа(), 
			ОбщегоНазначения.ИмяЗначенияПеречисления(ЭтапРаботы));
	Иначе
		ОбщегоНазначенияКлиентСервер.Проверить(Ложь, 
			СтрШаблон(НСтр("ru = 'Неожиданное значение этап работы = %1'"), ЭтапРаботы), 
			Метаданные.Справочники.Вакансии.ПолноеИмя());
	КонецЕсли;

	Возврат Строка;
	
КонецФункции

Функция ЭтапКандидатаПоНавигационнойСсылке(НавигационнаяСсылка) Экспорт
	
	Части = СтрРазделить(НавигационнаяСсылка, "_");
	ОбщегоНазначенияКлиентСервер.Проверить(Части.Количество() = 3, 
		СтрШаблон(НСтр("ru = 'Некорректная навигационная ссылка этапа кандидатов %1'"), НавигационнаяСсылка), 
		"ПодборПерсоналаФормы.ЭтапКандидатаПоНавигационнойСсылке");
	
	Если Части[1] = Метаданные.Справочники.ЭтапыРаботыСКандидатами.ПолноеИмя() Тогда
		Возврат ?(Части[2] = ИдентификаторПустогоЭтапа(), 
			Справочники.ЭтапыРаботыСКандидатами.ПустаяСсылка(), 
			Справочники.ЭтапыРаботыСКандидатами.ПолучитьСсылку(Новый УникальныйИдентификатор(Части[2])));
	ИначеЕсли Части[1] = Метаданные.Перечисления.ЭтапыРаботыСКандидатами.ПолноеИмя() Тогда
		Возврат ?(Части[2] = ИдентификаторПустогоЭтапа(), 
			Перечисления.ЭтапыРаботыСКандидатами.ПустаяСсылка(), 
			Перечисления.ЭтапыРаботыСКандидатами[Части[2]]);
	Иначе
		ОбщегоНазначенияКлиентСервер.Проверить(Ложь, 
			СтрШаблон(НСтр("ru = 'Некорректная навигационная ссылка этапа кандидатов %1'"), НавигационнаяСсылка), 
			"ПодборПерсоналаФормы.ЭтапКандидатаПоНавигационнойСсылке");
	КонецЕсли;
	
КонецФункции

Функция ИдентификаторПустогоЭтапа()
	Возврат "ПустаяСсылка";
КонецФункции

Функция СостояниеКандидатаЭтапСсылкаПоНавигационнойСтроке(НавигационнаяСсылкаФорматированнойСтроки) Экспорт

	СтрокаИдентификатора = СтрЗаменить(НавигационнаяСсылкаФорматированнойСтроки, "СостояниеКандидата_Этап_", "");
	Если СтрокаИдентификатора = "ПустаяСсылка" Тогда
		Возврат Справочники.ЭтапыРаботыСКандидатами.ПустаяСсылка();
	КонецЕсли;
	
	Возврат Справочники.ЭтапыРаботыСКандидатами.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаИдентификатора));
	
КонецФункции

Процедура СоздатьКомандуДобавленияНовогоКандидата(Форма, ГруппаКоманд)

	Гиперссылка = Форма.Элементы.Добавить("Кнопка", Тип("КнопкаФормы"), ГруппаКоманд);
	Гиперссылка.Вид = ВидКнопкиФормы.Гиперссылка;
	
	Команда = Форма.Команды.Добавить(ПодборПерсоналаКлиентСервер.ИмяКомандыНовыйКандидатВФормеФизическиеЛица());
	Команда.Заголовок = НСтр("ru = 'Новый кандидат'");
	Команда.Подсказка = НСтр("ru = 'Зарегистрировать обращение этого человека на вакансию'");
	Команда.Действие = "Подключаемый_ПодборПерсонала";
	
	Гиперссылка.ИмяКоманды = "НовыйКандидат";
	Гиперссылка.Заголовок = НСтр("ru = 'Новый кандидат'");
	
КонецПроцедуры

// Возвращает таблицу похожих кандидатов.
// 
// Параметры:
//  ЛичныеДанныеКандидата - Структура:
//   * Ссылка - СправочникСсылка.ЛичныеДанныеКандидатов
//   * Фамилия - Строка
//   * Имя - Строка
//   * Отчество - Строка
//   * УточнениеНаименования - Строка
//   * Телефон - Строка
//   * Email - Строка
//  ИсключитьСвязанныхСФизЛицами - Булево
// 
// Возвращаемое значение:
//  ТаблицаЗначений:
//   * Приоритет - Число
//   * ЛичныеДанныеКандидата - СправочникСсылка.ЛичныеДанныеКандидатов 
//   * Наименование - Строка 
//   * УточнениеНаименования - Строка 
//   * ФИОПолные - Строка 
//   * Фамилия - Строка 
//   * Имя - Строка 
//   * Отчество - Строка 
//   * Телефоны - Строка 
//   * АдресаЭлектроннойПочты - Строка 
//   * ДатаРождения - Дата 
//   * Пол - ПеречислениеСсылка.ПолФизическогоЛица 
//   * ИНН - Строка 
//   * СтраховойНомерПФР - Строка 
//   * МестоРождения - Строка 
//   * ТелефонПредставление - Строка 
//   * EmailПредставление - Строка 
Функция ПохожиеКандидаты(ЛичныеДанныеКандидата, ИсключитьСвязанныхСФизЛицами = Истина)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЛичныеДанныеКандидатов.Ссылка КАК ЛичныеДанныеКандидата,
		|	1 КАК Приоритет,
		|	ДанныеПоискаФизическихЛиц.Телефоны КАК Телефоны,
		|	ДанныеПоискаФизическихЛиц.АдресаЭлектроннойПочты КАК АдресаЭлектроннойПочты
		|ПОМЕСТИТЬ ВТЛичныеДанныеКандидатов
		|ИЗ
		|	Справочник.ЛичныеДанныеКандидатов КАК ЛичныеДанныеКандидатов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПоискаФизическихЛиц КАК ДанныеПоискаФизическихЛиц
		|		ПО (ДанныеПоискаФизическихЛиц.ФизическоеЛицо = ЛичныеДанныеКандидатов.Ссылка)
		|ГДЕ
		|	&НомерТелефона
		|	И ЛичныеДанныеКандидатов.Ссылка <> &Ссылка
		|	И НЕ ЛичныеДанныеКандидатов.ПометкаУдаления
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЛичныеДанныеКандидатов.Ссылка,
		|	2,
		|	ДанныеПоискаФизическихЛиц.Телефоны,
		|	ДанныеПоискаФизическихЛиц.АдресаЭлектроннойПочты
		|ИЗ
		|	Справочник.ЛичныеДанныеКандидатов КАК ЛичныеДанныеКандидатов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПоискаФизическихЛиц КАК ДанныеПоискаФизическихЛиц
		|		ПО (ДанныеПоискаФизическихЛиц.ФизическоеЛицо = ЛичныеДанныеКандидатов.Ссылка)
		|ГДЕ
		|	&АдресЭП
		|	И ЛичныеДанныеКандидатов.Ссылка <> &Ссылка
		|	И НЕ ЛичныеДанныеКандидатов.ПометкаУдаления
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЛичныеДанныеКандидатов.Ссылка,
		|	3,
		|	"""",
		|	""""
		|ИЗ
		|	Справочник.ЛичныеДанныеКандидатов КАК ЛичныеДанныеКандидатов
		|ГДЕ
		|	&ФИО
		|	И ЛичныеДанныеКандидатов.Ссылка <> &Ссылка
		|	И НЕ ЛичныеДанныеКандидатов.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЛичныеДанныеКандидатов.Приоритет КАК Приоритет,
		|	ЛичныеДанныеКандидатов.ЛичныеДанныеКандидата КАК ЛичныеДанныеКандидата,
		|	ЛичныеДанныеКандидатов.Телефоны КАК Телефоны,
		|	ЛичныеДанныеКандидатов.АдресаЭлектроннойПочты КАК АдресаЭлектроннойПочты
		|ИЗ
		|	ВТЛичныеДанныеКандидатов КАК ЛичныеДанныеКандидатов
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФизическиеЛицаКандидатов КАК ФизическиеЛицаКандидатов
		|		ПО ФизическиеЛицаКандидатов.ЛичныеДанныеКандидата = ЛичныеДанныеКандидатов.ЛичныеДанныеКандидата
		|		И НЕ ФизическиеЛицаКандидатов.ФизическоеЛицо.ПометкаУдаления
		|ГДЕ
		|	&ФизЛицо";
	
	Фамилия = ФизическиеЛицаЗарплатаКадры.ФамилияДляПоиска(ЛичныеДанныеКандидата.Фамилия);
	Имя = ФизическиеЛицаЗарплатаКадры.ИмяДляПоиска(ЛичныеДанныеКандидата.Имя);
	Отчество = ФизическиеЛицаЗарплатаКадры.ОтчествоДляПоиска(ЛичныеДанныеКандидата.Отчество);
	
	Запрос.УстановитьПараметр("Ссылка", ЛичныеДанныеКандидата.Ссылка);
		
	Если ЗначениеЗаполнено(ЛичныеДанныеКандидата.Телефон) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&НомерТелефона",
			"ДанныеПоискаФизическихЛиц.Телефоны ПОДОБНО &НомерТелефона");
		Запрос.УстановитьПараметр("НомерТелефона",
			"%" + ПоискФизическихЛиц.ТелефонВФорматеПоиска(ЛичныеДанныеКандидата.Телефон) + "%");
	Иначе
		Запрос.УстановитьПараметр("НомерТелефона", Ложь);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЛичныеДанныеКандидата.Email) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&АдресЭП",
			"ДанныеПоискаФизическихЛиц.АдресаЭлектроннойПочты ПОДОБНО &АдресЭП");
		Запрос.УстановитьПараметр("АдресЭП", "%" + ЛичныеДанныеКандидата.Email + "%");
	Иначе
		Запрос.УстановитьПараметр("АдресЭП", Ложь);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Фамилия + Имя + Отчество) Тогда
		УсловиеНаФИО = "
		|	(ЛичныеДанныеКандидатов.НаименованиеСлужебное ПОДОБНО &Фамилия СПЕЦСИМВОЛ ""~""
		|	ИЛИ ЛичныеДанныеКандидатов.НаименованиеСлужебное ПОДОБНО &ФамилияИмя СПЕЦСИМВОЛ ""~""
		|	ИЛИ ЛичныеДанныеКандидатов.НаименованиеСлужебное ПОДОБНО &ФамилияИмяОтчество СПЕЦСИМВОЛ ""~""
		|	ИЛИ ЛичныеДанныеКандидатов.НаименованиеСлужебное ПОДОБНО &ФамилияИмяОтчествоУточнение СПЕЦСИМВОЛ ""~"")";
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ФИО", УсловиеНаФИО);
		
		Запрос.УстановитьПараметр("ФамилияИмяОтчество", Фамилия + ?(ПустаяСтрока(Имя), "", " " + Имя)
			+ ?(ПустаяСтрока(Отчество), "%", " " + Отчество));
		Запрос.УстановитьПараметр("Фамилия", Фамилия);
		Запрос.УстановитьПараметр("ФамилияИмя", Фамилия + ?(ПустаяСтрока(Имя), "", " " + Имя));
		Запрос.УстановитьПараметр("ФамилияИмяОтчествоУточнение", Фамилия + ?(ПустаяСтрока(Имя), "", " " + Имя)
			+ ?(ПустаяСтрока(Отчество), "", " " + Отчество) + ?(ПустаяСтрока(Отчество), "", " "
			+ ЛичныеДанныеКандидата.УточнениеНаименования));
	Иначе
		Запрос.УстановитьПараметр("ФИО", Ложь);
	КонецЕсли;
	
	Если ИсключитьСвязанныхСФизЛицами Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ФизЛицо", "ФизическиеЛицаКандидатов.ФизическоеЛицо ЕСТЬ NULL");
	Иначе
		Запрос.УстановитьПараметр("ФизЛицо", Истина);
	КонецЕсли;
	
	ТаблицаПохожих = Запрос.Выполнить().Выгрузить();
	ТаблицаПохожих.Колонки.Добавить("ТелефонПредставление", Новый ОписаниеТипов("Строка"));
	ТаблицаПохожих.Колонки.Добавить("EmailПредставление", Новый ОписаниеТипов("Строка"));
	Для Каждого СтрокаДанных Из ТаблицаПохожих Цикл
		СтрокаДанных.ТелефонПредставление = УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформацииОбъекта(
			СтрокаДанных.ЛичныеДанныеКандидата, Справочники.ВидыКонтактнойИнформации.ТелефонЛичныеДанныеКандидатов);
		СтрокаДанных.EmailПредставление = УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформацииОбъекта(
			СтрокаДанных.ЛичныеДанныеКандидата, Справочники.ВидыКонтактнойИнформации.EMailЛичныеДанныеКандидатов);
	КонецЦикла;
	ОбщегоНазначенияБЗК.ДобавитьИндексКоллекции(ТаблицаПохожих, "ЛичныеДанныеКандидата");
	
	Возврат ТаблицаПохожих;
	
КонецФункции

Функция СовпадающиеДанныеПоПриоритету()
	
	Результат = Новый Соответствие();
	Результат.Вставить(1, "Телефон");
	Результат.Вставить(2, "E-mail");
	Результат.Вставить(3, "ФИО");
	
	Возврат Результат;
	
КонецФункции

// Представление автора комментария.
// 
// Параметры:
//  АвторКомментария - СправочникСсылка.Пользователи
// 
// Возвращаемое значение:
//  Строка - Представление автора комментария
Функция ПредставлениеАвтораКомментария(АвторКомментария) Экспорт
	
	Если АвторКомментария = Пользователи.СсылкаНеуказанногоПользователя() Тогда
		Возврат Пользователи.ПолноеИмяНеуказанногоПользователя();
	КонецЕсли;
	
	ФизическоеЛицоАвтора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(АвторКомментария, "ФизическоеЛицо");
	Если Не ЗначениеЗаполнено(ФизическоеЛицоАвтора) Тогда
		Возврат Строка(АвторКомментария);
	КонецЕсли;

	УстановитьПривилегированныйРежим(Истина);
	ФИОАвтора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ФизическоеЛицоАвтора, "Фамилия, Имя");
	УстановитьПривилегированныйРежим(Ложь);

	Возврат ФИОАвтора.Фамилия + ?(Не ПустаяСтрока(ФИОАвтора.Имя), " " + ФИОАвтора.Имя, "");
	
КонецФункции

// Установить этапы по умолчанию на сервере.
// 
// Параметры:
//  ЭтапыРаботыСКандидатами - ТабличнаяЧасть -
// 
// Возвращаемое значение:
//  Структура -- Установить этапы по умолчанию на сервере::
// * Добавленные - Массив из ПеречислениеСсылка.ЭтапыРаботыСКандидатами -
// * Удаленные - Массив из ПеречислениеСсылка.ЭтапыРаботыСКандидатами -
Функция УстановитьЭтапыПоУмолчанию(ЭтапыРаботыСКандидатами) Экспорт
	Результат = Новый Структура();
	Результат.Вставить("Добавленные", ПодборПерсонала.ДобавитьДействующиеПредопределенныеЭтапы(ЭтапыРаботыСКандидатами));
	Результат.Вставить("Удаленные", ПодборПерсонала.УдалитьНедействующиеПредопределенныеЭтапы(ЭтапыРаботыСКандидатами));
	Возврат Результат;
КонецФункции

#КонецОбласти
